# StructuralType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementStructuralTypeFilter..::..StructuralType Property
ElementStructuralTypeFilter Class See Also
---
The structural type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public StructuralType StructuralType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property StructuralType As StructuralType
	Get
```

Visual C++
---
```text
public:
property StructuralType StructuralType {
	StructuralType get ();
}
```

# See Also
ElementStructuralTypeFilter Class
Autodesk.Revit.DB Namespace